wolfSSL/wolfip/src/port/stm32f439/main.c
/* main.c
 *
 * wolfIP demo on STM32F437/F439.  Same chip family, two boards supported
 * via the BOARD make variable -- both end up at SYSCLK 168 MHz, PCLK1 42,
 * PCLK2 84, with the shared DWC GMAC driver in src/port/stm32f4/:
 *
 *   BOARD=nucleo_f439zi  (NUCLEO-F439ZI, default)
 *     - HSE: 8 MHz BYPASS from onboard ST-LINK MCO (no crystal)
 *     - VCP: USART3 on PD8 (TX) / PD9 (RX), AF7
 *     - PHY: LAN8742A at MDIO addr 0
 *     - RMII TXD1 on PB13
 *
 *   BOARD=stm32439i_eval  (STM32439I-EVAL)
 *     - HSE: 25 MHz crystal
 *     - VCP: UART4 on PC10 (TX) / PC11 (RX), AF8
 *     - PHY: DP83848 at MDIO addr 1
 *     - RMII TXD1 on PG14
 *
 * Brings up clocks, UART (ST-LINK VCP), SysTick, Ethernet, runs DHCP,
 * and answers TCP echo on port 7.  Pure register-level init -- no STM32
 * HAL dependency.
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfIP TCP/IP stack.
 *
 * wolfIP is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfIP is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "config.h"
#include "wolfip.h"
#include "stm32f4_eth.h"

#if !defined(BOARD_NUCLEO_F439ZI) && !defined(BOARD_STM32439I_EVAL)
#error "Define BOARD_NUCLEO_F439ZI or BOARD_STM32439I_EVAL (set BOARD= in make)"
#endif

#if defined(BOARD_NUCLEO_F439ZI)
#define BOARD_NAME "NUCLEO-F439ZI"
#define PHY_NAME   "LAN8742A"
#else
#define BOARD_NAME "STM32439I-EVAL"
#define PHY_NAME   "DP83848"
#endif

/* ===================================================================== */
/* Register definitions                                                  */
/* ===================================================================== */

#define RCC_BASE        0x40023800UL
#define RCC_CR          (*(volatile uint32_t *)(RCC_BASE + 0x00U))
#define RCC_PLLCFGR     (*(volatile uint32_t *)(RCC_BASE + 0x04U))
#define RCC_CFGR        (*(volatile uint32_t *)(RCC_BASE + 0x08U))
#define RCC_AHB1ENR     (*(volatile uint32_t *)(RCC_BASE + 0x30U))
#define RCC_APB1ENR     (*(volatile uint32_t *)(RCC_BASE + 0x40U))
#define RCC_APB2ENR     (*(volatile uint32_t *)(RCC_BASE + 0x44U))
#define RCC_AHB1RSTR    (*(volatile uint32_t *)(RCC_BASE + 0x10U))

#define RCC_CR_HSEON    (1U << 16)
#define RCC_CR_HSERDY   (1U << 17)
#define RCC_CR_HSEBYP   (1U << 18)
#define RCC_CR_PLLON    (1U << 24)
#define RCC_CR_PLLRDY   (1U << 25)

#define RCC_PLLCFGR_PLLSRC_HSE (1U << 22)

#define RCC_CFGR_SW_PLL  (2U << 0)
#define RCC_CFGR_SWS_PLL (2U << 2)
#define RCC_CFGR_HPRE_DIV1  (0U << 4)
#define RCC_CFGR_PPRE1_DIV4 (5U << 10)
#define RCC_CFGR_PPRE2_DIV2 (4U << 13)
#define RCC_CFGR_SW_MASK    (3U << 0)
#define RCC_CFGR_SWS_MASK   (3U << 2)
#define RCC_CFGR_HPRE_MASK  (0xFU << 4)
#define RCC_CFGR_PPRE1_MASK (7U << 10)
#define RCC_CFGR_PPRE2_MASK (7U << 13)

#define RCC_AHB1ENR_GPIOA   (1U << 0)
#define RCC_AHB1ENR_GPIOB   (1U << 1)
#define RCC_AHB1ENR_GPIOC   (1U << 2)
#define RCC_AHB1ENR_GPIOG   (1U << 6)
#define RCC_AHB1ENR_ETHMAC    (1U << 25)
#define RCC_AHB1ENR_ETHMACTX  (1U << 26)
#define RCC_AHB1ENR_ETHMACRX  (1U << 27)

#define RCC_APB1ENR_PWREN    (1U << 28)
#define RCC_APB1ENR_UART4EN  (1U << 19)
#define RCC_APB1ENR_USART3EN (1U << 18)
#define RCC_APB2ENR_SYSCFGEN (1U << 14)

#define RCC_AHB1RSTR_ETHMACRST (1U << 25)

#define FLASH_BASE      0x40023C00UL
#define FLASH_ACR       (*(volatile uint32_t *)(FLASH_BASE + 0x00U))
#define FLASH_ACR_LATENCY_5WS (5U << 0)
#define FLASH_ACR_PRFTEN     (1U << 8)
#define FLASH_ACR_ICEN       (1U << 9)
#define FLASH_ACR_DCEN       (1U << 10)

#define PWR_BASE        0x40007000UL
#define PWR_CR          (*(volatile uint32_t *)(PWR_BASE + 0x00U))
#define PWR_CR_VOS_SCALE1 (3U << 14)

#define SYSCFG_BASE     0x40013800UL
#define SYSCFG_PMC      (*(volatile uint32_t *)(SYSCFG_BASE + 0x04U))
#define SYSCFG_PMC_MII_RMII_SEL (1U << 23)

#define GPIOA_BASE      0x40020000UL
#define GPIOB_BASE      0x40020400UL
#define GPIOC_BASE      0x40020800UL
#define GPIOD_BASE      0x40020C00UL
#define GPIOG_BASE      0x40021800UL

#define RCC_AHB1ENR_GPIOD (1U << 3)

#define GPIO_MODER(b)   (*(volatile uint32_t *)((b) + 0x00U))
#define GPIO_OSPEEDR(b) (*(volatile uint32_t *)((b) + 0x08U))
#define GPIO_PUPDR(b)   (*(volatile uint32_t *)((b) + 0x0CU))
#define GPIO_AFRL(b)    (*(volatile uint32_t *)((b) + 0x20U))
#define GPIO_AFRH(b)    (*(volatile uint32_t *)((b) + 0x24U))

/* Per-board UART selection (both APB1). */
#if defined(BOARD_NUCLEO_F439ZI)
  #define UART_BASE         0x40004800UL  /* USART3 */
  #define UART_CLK_BIT      RCC_APB1ENR_USART3EN
  #define UART_PORT         GPIOD_BASE
  #define UART_RCC_GPIO_BIT RCC_AHB1ENR_GPIOD
  #define UART_TX_PIN       8U
  #define UART_RX_PIN       9U
  #define UART_AF           7U
#elif defined(BOARD_STM32439I_EVAL)
  #define UART_BASE         0x40004C00UL  /* UART4 */
  #define UART_CLK_BIT      RCC_APB1ENR_UART4EN
  #define UART_PORT         GPIOC_BASE
  #define UART_RCC_GPIO_BIT RCC_AHB1ENR_GPIOC
  #define UART_TX_PIN       10U
  #define UART_RX_PIN       11U
  #define UART_AF           8U
#endif

#define UART_SR         (*(volatile uint32_t *)(UART_BASE + 0x00U))
#define UART_DR         (*(volatile uint32_t *)(UART_BASE + 0x04U))
#define UART_BRR        (*(volatile uint32_t *)(UART_BASE + 0x08U))
#define UART_CR1        (*(volatile uint32_t *)(UART_BASE + 0x0CU))
#define USART_SR_TXE    (1U << 7)
#define USART_CR1_RE    (1U << 2)
#define USART_CR1_TE    (1U << 3)
#define USART_CR1_UE    (1U << 13)

/* SysTick (Cortex-M4 SCS) */
#define STK_CTRL        (*(volatile uint32_t *)0xE000E010UL)
#define STK_LOAD        (*(volatile uint32_t *)0xE000E014UL)
#define STK_VAL         (*(volatile uint32_t *)0xE000E018UL)
#define STK_CTRL_ENABLE   (1U << 0)
#define STK_CTRL_TICKINT  (1U << 1)
#define STK_CTRL_CLKSRC   (1U << 2)

