wolfSSL/wolfip/src/port/stm32f439/main.c
/* FPU coprocessor access (CP10/CP11) */
#define SCB_CPACR       (*(volatile uint32_t *)0xE000ED88UL)

/* SCB fault registers (used by hard-fault dump) */
#define SCB_HFSR        (*(volatile uint32_t *)0xE000ED2CUL)
#define SCB_CFSR        (*(volatile uint32_t *)0xE000ED28UL)
#define SCB_BFAR        (*(volatile uint32_t *)0xE000ED38UL)
#define SCB_MMFAR       (*(volatile uint32_t *)0xE000ED34UL)

/* ===================================================================== */
/* Globals                                                               */
/* ===================================================================== */

#define SYSCLK_HZ       168000000U
#define HCLK_HZ         168000000U
#define PCLK1_HZ        42000000U
#define PCLK2_HZ        84000000U

volatile uint64_t HAL_time_ms;

uint32_t stm32f4_eth_hclk_hz(void)
{
    return HCLK_HZ;
}

static struct wolfIP *IPStack;

#define ECHO_PORT       7
#define RX_BUF_SIZE     1024
static uint8_t rx_buf[RX_BUF_SIZE];
static int listen_fd = -1;
static int client_fd = -1;

#define DHCP_TIMEOUT_MS 30000U
#define DHCP_REINIT_MS  10000U

/* ===================================================================== */
/* UART output -- peripheral selection is in the BOARD #if block above   */
/* ===================================================================== */

static void uart_putc(char c)
{
    while ((UART_SR & USART_SR_TXE) == 0U) { }
    UART_DR = (uint32_t)(uint8_t)c;
}

static void uart_puts(const char *s)
{
    while (*s) {
        if (*s == '\n')
            uart_putc('\r');
        uart_putc(*s++);
    }
}

static void uart_puthex(uint32_t val)
{
    const char hex[] = "0123456789ABCDEF";
    int i;
    uart_puts("0x");
    for (i = 28; i >= 0; i -= 4)
        uart_putc(hex[(val >> i) & 0xFU]);
}

int _write(int file, const char *ptr, int len)
{
    int i;
    (void)file;
    for (i = 0; i < len; i++) {
        if (ptr[i] == '\n')
            uart_putc('\r');
        uart_putc(ptr[i]);
    }
    return len;
}

/* ===================================================================== */
/* Hard fault handler -- dump frame via the board's UART                  */
/* ===================================================================== */

void hard_fault_handler_c(uint32_t *frame)
{
    uart_puts("\n\n*** HARD FAULT ***\n");
    uart_puts("  PC:   "); uart_puthex(frame[6]); uart_puts("\n");
    uart_puts("  LR:   "); uart_puthex(frame[5]); uart_puts("\n");
    uart_puts("  R0:   "); uart_puthex(frame[0]); uart_puts("\n");
    uart_puts("  R1:   "); uart_puthex(frame[1]); uart_puts("\n");
    uart_puts("  R2:   "); uart_puthex(frame[2]); uart_puts("\n");
    uart_puts("  R3:   "); uart_puthex(frame[3]); uart_puts("\n");
    uart_puts("  R12:  "); uart_puthex(frame[4]); uart_puts("\n");
    uart_puts("  xPSR: "); uart_puthex(frame[7]); uart_puts("\n");
    uart_puts("  HFSR: "); uart_puthex(SCB_HFSR); uart_puts("\n");
    uart_puts("  CFSR: "); uart_puthex(SCB_CFSR); uart_puts("\n");
    if (SCB_CFSR & 0x00008200U) {
        uart_puts("  BFAR: "); uart_puthex(SCB_BFAR); uart_puts("\n");
    }
    if (SCB_CFSR & 0x00000082U) {
        uart_puts("  MMFAR:"); uart_puthex(SCB_MMFAR); uart_puts("\n");
    }
    while (1) { }
}

void HardFault_Handler(void) __attribute__((naked));
void HardFault_Handler(void)
{
    __asm volatile (
        "tst lr, #4              \n"
        "ite eq                  \n"
        "mrseq r0, msp           \n"
        "mrsne r0, psp           \n"
        "b hard_fault_handler_c  \n"
    );
}

/* ===================================================================== */
/* SysTick - 1 ms tick                                                    */
/* ===================================================================== */

void SysTick_Handler(void)
{
    HAL_time_ms++;
}

static void systick_init(void)
{
    STK_LOAD  = (SYSCLK_HZ / 1000U) - 1U;
    STK_VAL   = 0U;
    STK_CTRL  = STK_CTRL_CLKSRC | STK_CTRL_TICKINT | STK_CTRL_ENABLE;
}

/* ===================================================================== */
/* Clock init: HSE -> PLL -> SYSCLK 168 MHz, HCLK=168, PCLK1=42, PCLK2=84 */
/* ===================================================================== */

/* PLLM is picked so VCO_in = HSE / PLLM = 1 MHz (within the spec 1..2
 * MHz range).  NUCLEO HSE = 8 MHz (ST-LINK MCO bypass), EVAL HSE = 25
 * MHz crystal.  All other PLL params (PLLN=336, PLLP=2, PLLQ=7) and
 * downstream prescalers are identical, so SYSCLK lands at 168 MHz on
 * both boards. */
#if defined(BOARD_NUCLEO_F439ZI)
#define PLLM_VAL  8U
#elif defined(BOARD_STM32439I_EVAL)
#define PLLM_VAL  25U
#endif

static int clock_init(void)
{
    uint32_t timeout;

    /* Enable PWR and select VOS scale 1 (required for SYSCLK > 144 MHz). */
    RCC_APB1ENR |= RCC_APB1ENR_PWREN;
    (void)RCC_APB1ENR;
    PWR_CR = (PWR_CR & ~(3U << 14)) | PWR_CR_VOS_SCALE1;

    /* HSE source.  NUCLEO uses HSE_BYPASS (8 MHz from ST-LINK MCO);
     * STM32439I-EVAL has a real 25 MHz crystal. */
#if defined(BOARD_NUCLEO_F439ZI)
    RCC_CR |= RCC_CR_HSEBYP;
#endif
    RCC_CR |= RCC_CR_HSEON;
    timeout = 1000000U;
    while (!(RCC_CR & RCC_CR_HSERDY) && (timeout > 0U)) {
        timeout--;
    }
    if (timeout == 0U)
        return -1;

    /* Flash latency 5 WS (3.3 V, 150-168 MHz HCLK), enable caches +
     * prefetch.  Must be set BEFORE switching SYSCLK to PLL. */
    FLASH_ACR = FLASH_ACR_LATENCY_5WS | FLASH_ACR_PRFTEN |
                FLASH_ACR_ICEN | FLASH_ACR_DCEN;

    /* PLL configuration -- see PLLM_VAL comment above for board math.
     * PLLP=2 is encoded as 0 in bits 17:16.  PLLQ=7 yields 48 MHz PLL48
     * (for OTG_FS / RNG / SDIO when added later). */
    RCC_CR &= ~RCC_CR_PLLON;
    timeout = 100000U;
    while ((RCC_CR & RCC_CR_PLLRDY) && (timeout > 0U)) {
        timeout--;
    }
    RCC_PLLCFGR = RCC_PLLCFGR_PLLSRC_HSE |
                  (PLLM_VAL << 0) |
                  (336U << 6)     |   /* PLLN = 336 */
                  (0U << 16)      |   /* PLLP = /2 */
                  (7U << 24);         /* PLLQ = /7 */
    RCC_CR |= RCC_CR_PLLON;
    timeout = 1000000U;
    while (!(RCC_CR & RCC_CR_PLLRDY) && (timeout > 0U)) {
        timeout--;
    }
    if (timeout == 0U)
        return -2;

