wolfSSL/wolfip/src/port/stm32f439/main.c
    /* AHB/1, APB1/4 (=42 MHz), APB2/2 (=84 MHz). */
    RCC_CFGR = (RCC_CFGR & ~(RCC_CFGR_HPRE_MASK | RCC_CFGR_PPRE1_MASK |
                              RCC_CFGR_PPRE2_MASK)) |
               RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV4 |
               RCC_CFGR_PPRE2_DIV2;

    /* Switch SYSCLK to PLL. */
    RCC_CFGR = (RCC_CFGR & ~RCC_CFGR_SW_MASK) | RCC_CFGR_SW_PLL;
    timeout = 100000U;
    while (((RCC_CFGR & RCC_CFGR_SWS_MASK) != RCC_CFGR_SWS_PLL) &&
           (timeout > 0U)) {
        timeout--;
    }
    return (timeout > 0U) ? 0 : -3;
}

/* ===================================================================== */
/* UART init -- pins/AF/peripheral chosen at compile time by BOARD       */
/* ===================================================================== */

static void uart_init(void)
{
    /* GPIO clock for the chosen TX/RX port. */
    RCC_AHB1ENR |= UART_RCC_GPIO_BIT;
    (void)RCC_AHB1ENR;

    /* MODER = AF (10b) for TX and RX pins. */
    GPIO_MODER(UART_PORT) &= ~((3U << (UART_TX_PIN * 2)) |
                                (3U << (UART_RX_PIN * 2)));
    GPIO_MODER(UART_PORT) |=  ((2U << (UART_TX_PIN * 2)) |
                                (2U << (UART_RX_PIN * 2)));

    /* High speed. */
    GPIO_OSPEEDR(UART_PORT) |= (3U << (UART_TX_PIN * 2)) |
                                (3U << (UART_RX_PIN * 2));

    /* AF mux.  Both TX and RX pins are >= 8 on both boards (PD8/PD9 or
     * PC10/PC11), so AFRH is the right register. */
    GPIO_AFRH(UART_PORT) &= ~((0xFU << ((UART_TX_PIN - 8U) * 4)) |
                              (0xFU << ((UART_RX_PIN - 8U) * 4)));
    GPIO_AFRH(UART_PORT) |=  ((UART_AF << ((UART_TX_PIN - 8U) * 4)) |
                              (UART_AF << ((UART_RX_PIN - 8U) * 4)));

    /* UART peripheral clock. */
    RCC_APB1ENR |= UART_CLK_BIT;
    (void)RCC_APB1ENR;

    /* 115200 8N1 @ PCLK1 = 42 MHz.  BRR = PCLK / baud (mantissa+fraction
     * is encoded together when oversampling 16). */
    UART_CR1 = 0U;
    UART_BRR = (PCLK1_HZ + (115200U / 2U)) / 115200U;
    UART_CR1 = USART_CR1_TE | USART_CR1_RE | USART_CR1_UE;
}

/* ===================================================================== */
/* Ethernet RCC + GPIO + SYSCFG                                          */
/*                                                                       */
/* Shared RMII pins (both boards):                                       */
/*   PA1  ETH_RMII_REF_CLK    AF11                                       */
/*   PA2  ETH_MDIO            AF11                                       */
/*   PA7  ETH_RMII_CRS_DV     AF11                                       */
/*   PC1  ETH_MDC             AF11                                       */
/*   PC4  ETH_RMII_RXD0       AF11                                       */
/*   PC5  ETH_RMII_RXD1       AF11                                       */
/*   PG11 ETH_RMII_TX_EN      AF11                                       */
/*   PG13 ETH_RMII_TXD0       AF11                                       */
/*                                                                       */
/* Board-specific:                                                       */
/*   NUCLEO-F439ZI (per UM1974):  RMII_TXD1 = PB13 AF11                  */
/*   STM32439I-EVAL (per UM1670): RMII_TXD1 = PG14 AF11                  */
/* ===================================================================== */

static void gpio_set_af(uint32_t base, uint32_t pin, uint32_t af)
{
    /* MODER = AF (10b) */
    GPIO_MODER(base) &= ~(3U << (pin * 2));
    GPIO_MODER(base) |=  (2U << (pin * 2));
    /* Push-pull (OTYPER=0 default) */
    /* Very high speed */
    GPIO_OSPEEDR(base) |= (3U << (pin * 2));
    /* No pull */
    GPIO_PUPDR(base)   &= ~(3U << (pin * 2));
    /* AF select */
    if (pin < 8U) {
        GPIO_AFRL(base) &= ~(0xFU << (pin * 4));
        GPIO_AFRL(base) |=  (af   << (pin * 4));
    } else {
        GPIO_AFRH(base) &= ~(0xFU << ((pin - 8U) * 4));
        GPIO_AFRH(base) |=  (af   << ((pin - 8U) * 4));
    }
}

static void eth_pins_init(void)
{
    /* Need GPIOA, GPIOC, GPIOG always; GPIOB only for NUCLEO TXD1. */
    RCC_AHB1ENR |= RCC_AHB1ENR_GPIOA | RCC_AHB1ENR_GPIOC | RCC_AHB1ENR_GPIOG;
#if defined(BOARD_NUCLEO_F439ZI)
    RCC_AHB1ENR |= RCC_AHB1ENR_GPIOB;
#endif
    (void)RCC_AHB1ENR;

    /* Port A */
    gpio_set_af(GPIOA_BASE, 1U, 11U); /* RMII_REF_CLK */
    gpio_set_af(GPIOA_BASE, 2U, 11U); /* MDIO */
    gpio_set_af(GPIOA_BASE, 7U, 11U); /* RMII_CRS_DV */

    /* Port C */
    gpio_set_af(GPIOC_BASE, 1U, 11U); /* MDC */
    gpio_set_af(GPIOC_BASE, 4U, 11U); /* RMII_RXD0 */
    gpio_set_af(GPIOC_BASE, 5U, 11U); /* RMII_RXD1 */

    /* Port G shared TX_EN + TXD0; TXD1 differs per board. */
    gpio_set_af(GPIOG_BASE, 11U, 11U); /* RMII_TX_EN */
    gpio_set_af(GPIOG_BASE, 13U, 11U); /* RMII_TXD0 */
#if defined(BOARD_NUCLEO_F439ZI)
    gpio_set_af(GPIOB_BASE, 13U, 11U); /* RMII_TXD1 (NUCLEO) */
#else
    gpio_set_af(GPIOG_BASE, 14U, 11U); /* RMII_TXD1 (EVAL)  */
#endif
}

static void eth_clk_init(void)
{
    /* SYSCFG clock so PMC.MII_RMII_SEL can be written. */
    RCC_APB2ENR |= RCC_APB2ENR_SYSCFGEN;
    (void)RCC_APB2ENR;

    /* Select RMII before enabling MAC clocks. */
    SYSCFG_PMC |= SYSCFG_PMC_MII_RMII_SEL;

    /* Enable MAC + TX + RX clocks. */
    RCC_AHB1ENR |= RCC_AHB1ENR_ETHMAC | RCC_AHB1ENR_ETHMACTX |
                   RCC_AHB1ENR_ETHMACRX;
    (void)RCC_AHB1ENR;

    /* Pulse MAC peripheral reset.  Hold ~1ms then release. */
    RCC_AHB1RSTR |= RCC_AHB1RSTR_ETHMACRST;
    { volatile uint32_t d; for (d = 0; d < 200000U; d++) { } }
    RCC_AHB1RSTR &= ~RCC_AHB1RSTR_ETHMACRST;
    { volatile uint32_t d; for (d = 0; d < 200000U; d++) { } }
}

/* ===================================================================== */
/* wolfIP random number source                                            */
/* ===================================================================== */

uint32_t wolfIP_getrandom(void)
{
    static uint32_t lfsr;
    static int seeded;

