wolfSSL/wolfip/src/port/stm32f439/main.c
    if (!seeded) {
        lfsr = (uint32_t)HAL_time_ms;
        if (lfsr == 0U)
            lfsr = 0xC0FFEE01U;
        seeded = 1;
    }
    lfsr ^= lfsr << 13;
    lfsr ^= lfsr >> 17;
    lfsr ^= lfsr << 5;
    return lfsr;
}

/* ===================================================================== */
/* Echo server callback                                                  */
/* ===================================================================== */

static void uart_putip4(ip4 ip)
{
    printf("%u.%u.%u.%u",
        (unsigned)((ip >> 24) & 0xFFU),
        (unsigned)((ip >> 16) & 0xFFU),
        (unsigned)((ip >> 8)  & 0xFFU),
        (unsigned)( ip        & 0xFFU));
}

static void echo_cb(int fd, uint16_t event, void *arg)
{
    struct wolfIP *s = (struct wolfIP *)arg;
    int ret;

    if ((fd == listen_fd) && (event & CB_EVENT_READABLE) &&
        (client_fd == -1)) {
        client_fd = wolfIP_sock_accept(s, listen_fd, NULL, NULL);
        if (client_fd > 0) {
            printf("Echo: client connected (fd=%d)\n", client_fd);
            wolfIP_register_callback(s, client_fd, echo_cb, s);
        }
        return;
    }

    if ((fd == client_fd) && (event & CB_EVENT_READABLE)) {
        ret = wolfIP_sock_recvfrom(s, client_fd, rx_buf, sizeof(rx_buf),
                                   0, NULL, NULL);
        if (ret > 0) {
            (void)wolfIP_sock_sendto(s, client_fd, rx_buf, (uint32_t)ret,
                                     0, NULL, 0);
        } else if (ret == 0) {
            printf("Echo: client disconnected\n");
            wolfIP_sock_close(s, client_fd);
            client_fd = -1;
        }
    }

    if ((fd == client_fd) && (event & CB_EVENT_CLOSED)) {
        printf("Echo: connection closed\n");
        wolfIP_sock_close(s, client_fd);
        client_fd = -1;
    }
}

/* ===================================================================== */
/* main                                                                  */
/* ===================================================================== */

int main(void)
{
    struct wolfIP_ll_dev *ll;
    struct wolfIP_sockaddr_in addr;
    int ret;

    /* Enable FPU (CP10 + CP11 full access). */
    SCB_CPACR |= (0xFU << 20);
    __asm volatile ("dsb sy" ::: "memory");
    __asm volatile ("isb sy" ::: "memory");

    /* clock_init() can only fail if HSE/PLL never come ready.  If it
     * does, UART output won't make it out at the expected baud anyway,
     * so there is nothing useful to print -- just continue and let the
     * watchdog (or the user) catch the dead board. */
    (void)clock_init();

    systick_init();
    uart_init();

    printf("\n\n=== wolfIP STM32F437/F439 (" BOARD_NAME ") ===\n");
    printf("Build: " __DATE__ " " __TIME__ "\n");
    printf("SYSCLK = %u Hz, HCLK = %u Hz, PCLK1 = %u Hz, PCLK2 = %u Hz\n",
           (unsigned)SYSCLK_HZ, (unsigned)HCLK_HZ,
           (unsigned)PCLK1_HZ, (unsigned)PCLK2_HZ);

    /* Bring up Ethernet RCC/GPIO/SYSCFG before wolfIP init. */
    eth_pins_init();
    eth_clk_init();

    wolfIP_init_static(&IPStack);

    printf("Initializing Ethernet (RMII + " PHY_NAME ")...\n");
    ll = wolfIP_getdev(IPStack);
    ret = stm32f4_eth_init(ll, NULL);
    if (ret == -2) {
        printf("  NOTE: PHY link down at startup -- continuing\n");
    } else if (ret < 0) {
        printf("  ERROR: stm32f4_eth_init failed (%d)\n", ret);
    }

#ifdef DHCP
    printf("Starting DHCP...\n");
    (void)wolfIP_poll(IPStack, HAL_time_ms);
    (void)dhcp_client_init(IPStack);
#else
    {
        ip4 ip = atoip4(WOLFIP_IP);
        ip4 nm = atoip4(WOLFIP_NETMASK);
        ip4 gw = atoip4(WOLFIP_GW);
        printf("Static IP:\n");
        printf("  IP:   "); uart_putip4(ip); printf("\n");
        printf("  Mask: "); uart_putip4(nm); printf("\n");
        printf("  GW:   "); uart_putip4(gw); printf("\n");
        wolfIP_ipconfig_set(IPStack, ip, nm, gw);
    }
#endif

    memset(&addr, 0, sizeof(addr));
    addr.sin_family = AF_INET;
    addr.sin_addr.s_addr = 0;
    addr.sin_port = ee16(ECHO_PORT);

    printf("TCP echo server on port %d\n", ECHO_PORT);
    listen_fd = wolfIP_sock_socket(IPStack, AF_INET, IPSTACK_SOCK_STREAM, 0);
    wolfIP_register_callback(IPStack, listen_fd, echo_cb, IPStack);
    (void)wolfIP_sock_bind(IPStack, listen_fd,
                           (struct wolfIP_sockaddr *)&addr, sizeof(addr));
    (void)wolfIP_sock_listen(IPStack, listen_fd, 1);

    printf("Ready! Test with:\n");
    printf("  ping <ip>\n");
    printf("  echo 'hello' | nc <ip> 7\n\n");

    {
        uint64_t last_diag_ms = 0;
#ifdef DHCP
        uint64_t dhcp_start_ms = HAL_time_ms;
        uint64_t dhcp_reinit_ms = HAL_time_ms;
        int dhcp_done = 0;
#endif

        for (;;) {
            uint64_t now = HAL_time_ms;
            (void)wolfIP_poll(IPStack, now);

#ifdef DHCP
            if (!dhcp_done) {
                if (dhcp_bound(IPStack)) {
                    ip4 ip = 0, nm = 0, gw = 0;
                    wolfIP_ipconfig_get(IPStack, &ip, &nm, &gw);
                    printf("DHCP bound:\n");
                    printf("  IP:   "); uart_putip4(ip); printf("\n");
                    printf("  Mask: "); uart_putip4(nm); printf("\n");
                    printf("  GW:   "); uart_putip4(gw); printf("\n");
                    dhcp_done = 1;
                } else if ((now - dhcp_start_ms) > DHCP_TIMEOUT_MS) {
                    ip4 ip = 0, nm = 0, gw = 0;
                    wolfIP_ipconfig_get(IPStack, &ip, &nm, &gw);
                    if (ip == 0U) {
                        ip = atoip4(WOLFIP_IP);
                        nm = atoip4(WOLFIP_NETMASK);
                        gw = atoip4(WOLFIP_GW);
                        printf("DHCP timeout, using static fallback:\n");
                        wolfIP_ipconfig_set(IPStack, ip, nm, gw);
                    } else {
                        printf("DHCP assigned IP:\n");
                    }
                    printf("  IP:   "); uart_putip4(ip); printf("\n");
                    printf("  Mask: "); uart_putip4(nm); printf("\n");
                    printf("  GW:   "); uart_putip4(gw); printf("\n");
                    dhcp_done = 1;
                } else if ((now - dhcp_reinit_ms) > DHCP_REINIT_MS) {
                    (void)dhcp_client_init(IPStack);
                    dhcp_reinit_ms = now;
                }
            }
#endif

            if ((now - last_diag_ms) >= 10000U) {
                uint32_t pkts, tx_pkts, tx_errs;
                uint32_t mac_cfg, mac_dbg;
                stm32f4_eth_get_stats(NULL, &pkts, &tx_pkts, &tx_errs);
                stm32f4_eth_get_mac_diag(&mac_cfg, &mac_dbg);
                printf("[%lu] rx=%lu tx=%lu/%lu maccr=0x%08lX "
                       "macdbg=0x%08lX dmasr=0x%08lX\n",
                       (unsigned long)(now / 1000U),
                       (unsigned long)pkts,
                       (unsigned long)tx_pkts,
                       (unsigned long)tx_errs,
                       (unsigned long)mac_cfg,
                       (unsigned long)mac_dbg,
                       (unsigned long)stm32f4_eth_get_dma_status());
                last_diag_ms = now;
            }
        }
    }
}
